import 'package:flutter_alli_mohammed_hassan/screen/call_us_file/call_us.dart';
import 'package:flutter_alli_mohammed_hassan/screen/homePage.dart';

class MyText {
// Articles_page
  static const title1 = "المقالات";
  // Articles
  static const title2 = "أذكار النوم الصحيحة أذكار النوم الصحيحة  أذكار النوم الصحيحة ";
// next_articels
  static const title3 = "أذكار النوم الصحيحة أذكار النوم الصحيحة  أذكار النوم الصحيحة ";
// Recently_added_Articles
  static const title4 = "أذكار النوم الصحيحة أذكار النوم الصحيحة  أذكار النوم الصحيحة ";
// Books and publications_page
  static const title5 =  "الكتب والمؤلفات";
  static const title6 = "الكتب والمؤلفات";
  // Books_and_publications
  static const title7 = "الآثار العقدية الواردة عن الخلفاء الراشدين  الأربعة تنسيق 7-4-2022 (1)";
  // Recently_added_Books
  static const title8 = "الآثار العقدية الواردة عن الخلفاء الراشدين  الأربعة تنسيق 7-4-2022 (1)";
//  Fatwas_page
  static const title9 = "الفتاوى";
  // Fatwas
  static const title10 = "هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟";
  // next_fatwas
  static const title11 ="هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟." ;
  static const title12 = "00158:رقم الفتوى ";
  static const title13 =  "السلام عليكم ورحمة الله وبركاته";
  static const title14 =":السؤال";
  static const title15 = ":الجواب";
  static const title16 =".الحمدلله\n : وعن النُّعْمَانَ بْنَ بَشِيرٍ رضي الله عنهما قال : كَانَ رَسُولُ اللَّهِ صَلَّى عَلَيْهِ وَسَلَّمَ يَمْسَحُ مَنَاكِبَنَا فِي الصَّلاةِ وَيَقُولُ : ( اسْتَوُوا , وَلا تَخْتَلِفُواوعَنْ أَبِي مَسْعُودٍ رضي الله عنه قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ ( سَوُّوا صُفُوفَكُمْ , فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ إِقَامَةِ الصَّلاةِ ) . لا تُقِيمُونَ الصُّفُوفَ ) رواه البخاري (724) .  صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَ : ( مَا أَنْكَرْتُ شَيْئًا إِلا أَنَّكُمْ  أَنَّهُ قَدِمَ الْمَدِينَةَ فَقِيلَ لَهُ : مَا أَنْكَرْتَ مِنَّا مُنْذُ يَوْمِ عَهِدْتَ رَسُولَ اللَّهِ , وأورد فيه بسنده عَنْ بُشَيْرِ بْنِ يَسَارٍ الْأَنْصَارِيِّ عَنْ أَنَسِ بْنِ مَالِكٍقال البخاري رحمه الله في صحيحه : ( باب إثم من لا يتم الصفوف )  فهذه النصوص واضحة في وجوب تسوية الصفوف , رواه البخاري ( 690 ) ومسلم ( 433) , وفي رواية للبخاري ( 723 )رواه البخاري ( 690 ) ومسلم ( 433) , وفي رواية للبخاري ( 723 ) : ( سَوُّوا صُفُوفَكُمْ , فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلاةِ )   فعنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصفوف , وأظهر فضيلة تسويتها , والاهتمام بها . لقد أولى الإسلام صفوف المصلين عناية كبيرة , حيث أمر بتسوية فعنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ  وعن النُّعْمَانَ بْنَ بَشِيرٍ رضي الله عنهما قال : كَانَ رَسُولُ اللَّهِ صَلَّى عَلَيْهِ وَسَلَّمَ يَمْسَحُ مَنَاكِبَنَا فِي الصَّلاةِ وَيَقُولُ : ( اسْتَوُوا , وَلا تَخْتَلِفُواوعَنْ أَبِي مَسْعُودٍ رضي الله عنه قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ ( سَوُّوا صُفُوفَكُمْ , فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ إِقَامَةِ الصَّلاةِ ) . لا تُقِيمُونَ الصُّفُوفَ ) رواه البخاري (724) .  صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَ : ( مَا أَنْكَرْتُ شَيْئًا إِلا أَنَّكُمْ  أَنَّهُ قَدِمَ الْمَدِينَةَ فَقِيلَ لَهُ : مَا أَنْكَرْتَ مِنَّا مُنْذُ يَوْمِ عَهِدْتَ رَسُولَ اللَّهِ , وأورد فيه بسنده عَنْ بُشَيْرِ بْنِ يَسَارٍ الْأَنْصَارِيِّ عَنْ أَنَسِ بْنِ مَالِكٍقال البخاري رحمه الله في صحيحه : ( باب إثم من لا يتم الصفوف )  فهذه النصوص واضحة في وجوب تسوية الصفوف , رواه البخاري ( 690 ) ومسلم ( 433) , وفي رواية للبخاري ( 723 )رواه البخاري ( 690 ) ومسلم ( 433) , وفي رواية للبخاري ( 723 ) : ( سَوُّوا صُفُوفَكُمْ , فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلاةِ )   فعنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصفوف , وأظهر فضيلة تسويتها , والاهتمام بها . لقد أولى الإسلام صفوف المصلين عناية كبيرة , حيث أمر بتسوية فعنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّ";
//  Recently_added_Fatwas
  static const title17 ="هل تسوية الصفوف في صلاة الجماعة واجبة ، بمعنى  أن المصلين يأثمون إذا لم يسووا الصفوف ؟" ;
// Recently_added_Religious
  static const title18 = "يتحقق تعظيم الله تعالى بإثبات صفاته  له كما يليق به  له كما يليق به";
  // Religious_pearls_page
  static const title19 = "الدرر الدينية";
  // ReligiousPearls
  static const title20 = "يتحقق تعظيم الله تعالى بإثبات صفاته  له كما يليق به  له كما يليق به";
  // next_video
  static const title40 = ":الفوائد العلمية المطرية في التعليقات على الأربعين النووية";
  static const title41 = ": الاولى";
  static const title42 = ":الفوائد العلمية المطرية في التعليقات  على الأربعين النووية ";
 
  static const title21 =  "لفوائد-العلمية-المطرية في التعليقات\n على الأربعين  النووي";
  // Recently_added_videos
  
  static const title22 = "الفوائد العلمية المطرية في التعليقات على الأربعين النووية ";
  static const title23 = ":المرئيات";
  // static final title22 = ":الجواب";
  // video_page
  
  // videos
  
  static const title24 =  "الفوائد العلمية المطرية في التعليقات على الأربعين النووية ";
  // next_voice
  
  static const title25 =  "لفوائد-العلمية-المطرية في التعليقات\n على الأربعين  النووي";
  static const title26 = ":النوع الرابع والخمسون  بعنوان";
  static const title27 = "حكم المعلقات في صحيح البخاري ";
  // Recently_added_Voices
  static const title28 = "روائع ابن القيم رحمه الله";
  // voice_page
  static const title29 = "الصوتيات";
  // voices
  static const title30 =  "روائع ابن القيم رحمه الله";

  // Abut_Sheikh_page
  static const title31 = "مناقشة رسالة الدكتورة بعنوان الأثار العقدية الواردة عن الخلفاء  الراشدين الأربعة";
  static const title32 = "مناقشة رسالة الدكتورة بعنوان الأثار العقدية الواردة عن الخلفاء  الراشدين الأربعة";
  static const title33 = "مناقشة رسالة الدكتورة بعنوان الأثار العقدية الواردة عن الخلفاء  الراشدين الأربعة";
  static const title34 = "مناقشة رسالة الدكتورة بعنوان الأثار العقدية الواردة عن الخلفاء  الراشدين الأربعة";
  static const title35 = "مناقشة رسالة الدكتورة بعنوان الأثار العقدية الواردة عن الخلفاء  الراشدين الأربعة";
  static const title36 ="عن الشيخ";
  // CallUs
  static const title39 =" اتصل بنا";


// HomePage
  static const title37 =" الرئيسية";
  // Important_links
  static const title38 =" روابط تهمك";


  // in_all_app
  static const text_general1 = "المضاف مؤاخراً";

}
